#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/blackboards/infrastructure/runs/run-F64FJrXqEd35FKp7

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
digitalocean_domain.blackboards: Refreshing state... [id=blackboards.pl]
digitalocean_domain.opentracker: Refreshing state... [id=opentracker.app]
digitalocean_droplet_snapshot.original-main-snapshot: Refreshing state... [id=126133672]
digitalocean_droplet.secondary: Refreshing state... [id=332540871]
digitalocean_record.ns1: Refreshing state... [id=126390270]
digitalocean_record.ns2: Refreshing state... [id=126390272]
digitalocean_record.ns3: Refreshing state... [id=126390273]
digitalocean_record.opentracker-ns2: Refreshing state... [id=313829953]
digitalocean_record.opentracker-ns3: Refreshing state... [id=313829951]
digitalocean_record.opentracker-ns1: Refreshing state... [id=313829950]
digitalocean_project.blackboards: Refreshing state... [id=d006b183-c896-4d41-a341-fb46d729eeb6]
digitalocean_record.opentracker-root: Refreshing state... [id=313829952]
aws_s3_bucket.remote_state: Refreshing state... [id=terraform-remote-state-m3rc9k]
aws_s3_bucket.remote_state: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.iac_deployer will be created
  + resource "aws_iam_policy" "iac_deployer" {
      + arn         = (known after apply)
      + description = "Permissions assigned to the IAC Deployer role"
      + id          = (known after apply)
      + name        = "iac-deployer-policy"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                          + "s3:Get*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role.iac_deployer will be created
  + resource "aws_iam_role" "iac_deployer" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "s3.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "iac-deployer"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.iac_deployer will be created
  + resource "aws_iam_role_policy_attachment" "iac_deployer" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "iac-deployer"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

```

</details>